// #include<stdio.h>

// main()
// {
//     int a[2][2] = {{0, 1}, {2, 3}};
//     printf("a+1 = %d, *(a+1) = %d", a+1, **(a+1));
// }

#include<stdio.h>
// 要从语言的角度分析，而不是检视“值”！！！
main()
{
    int a[3][4] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11};
    printf("%d ,", a);// 二维数组a的地址, a = &a[0][0] = *a = a[0]
    printf("%d, ", *a);// 一维数组a[0]的地址
    printf("%d, ", a[0]);// 一维数组a[0]的地址
    printf("%d, ", &a[0]);// 二维数组视角下一维数组a[0]的地址
    printf("%d\n", &a[0][0]);
    printf("%d, ", a+1);
    printf("%d, ", *(a+1));// 二维数组中第二个一维数组的地址
    printf("%d, ", a[1]);// 二维数组中第二个一维数组的地址
    printf("%d, ", &a[1]);
    printf("%d\n", &a[1][0]);
    printf("%d, ", a+2);// 二维数组第三个一维数组的地址
    printf("%d, ", *(a+2));// 二维数组第三个一维数组的地址 //解引用 有降维的效果
    printf("%d, ", a[2]); // 二维数组中第三个一维数组的地址
    printf("%d, ", &a[2]);// 二维数组视角下第三个一维数组的地址
    printf("%d\n", &a[2][0]);// 二维数组第三个一维数组的地址
    printf("%d, ", a[1]+1);// 二维数组第二个一维数组第二个元素a[1][1]的地址
    printf("%d\n", *(a+1)+1);// 二维数组第二个一维数组第二个元素a[1][1]的地址
    printf("%d, %d\n", *(a[1]+1), *(*(a+1)+1));// *(a[1]+1)取得了元素a[1][1]的值， *(*(a+1)+1)也取得元素a[1][1]的值
}